# 4.5 Data Consistency Checks

### This script contains the following points:

### 1. Importing Libraries - pandas, numpy, os

### 2. Creating a new test dataframe - Mixed Data Types

### 3. Finding missing values in df_prods

### 4. Creating a Subset for Missing Values

### 5. Removing Missing Values from df_prods

### 6. Finding Duplicates in df_prods dataframe

### 7. Investigate any unsual data - df_prods.describe()

### 8. Check for mixed-type data in your df_ords dataframe

### 9. Fix any mixed data types

### 10. Check for missing values in your df_ords dataframe

### 11. Address the missing values using an appropriate method

### 12. Check for duplicate values in your df_ords data

### 13. Exporting Dataframes to CSV

# 1. Importing Libraries - pandas, numpy, os

In [3]:
import pandas as pd
import numpy as np
import os

In [4]:
path = r'C:\Users\Rujii\Desktop\CareerFoundry\Section 4\2020 InstaCart Bucket Analysis'

In [5]:
df_prods= pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [6]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [7]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [8]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

# 2. Creating a new test dataframe - Mixed Data Types

In [9]:
# Create a dataframe 

df_test = pd.DataFrame()

In [10]:
# Create a mixed type data columm

df_test['mix'] = ['a', 'b', 1, True]

In [11]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [12]:
# Function to see if there are mixed datatypes

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\Rujii\AppData\Local\Temp\ipykernel_15952\1789352582.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [13]:
for col in df_test.columns.tolist():
    weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_test[weird]) > 0:
        print(col)

mix

# 3. Finding missing values in df_prods

In [14]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

# 4. Creating a Subset for Missing Values

In [15]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [16]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# 5. Removing Missing Values from df_prods

In [17]:
df_prods.shape #show number of columns and rows with (including missing values)

(49693, 5)

In [18]:
# create a new datbase excluding null values 

df_prods_clean = df_prods[df_prods['product_name'].isnull()== False]

In [19]:
# show the number of rows in the new dataframe

df_prods_clean.shape

(49677, 5)

# 6. Finding Duplicates in df_prods dataframe

In [20]:
# create a new database df_dups only showing duplicates from df_prods_clean 

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [21]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [22]:
# number of rows including duplicates 

df_prods_clean.shape

(49677, 5)

In [23]:
# create a new dataframe with no duplicates

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [24]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [25]:
df_prods_clean_no_dups.shape

(49672, 5)

# 7. Investigate any unsual data - df_prods.describe()

In [26]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [27]:
# The maximum price in prices coloumn is 99999 which looks like an outlier as this price it too high.

# 8. Check for mixed-type data in your df_ords dataframe

In [28]:
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_ords[weird]) > 0:
        print(col)
        
# There was no output when this code was run therefore this means that there is not a mixed data type in df_ords dataframe.

# 9. Fix any mixed data types

In [29]:
# There are no columns with a mixed data type.


# 10. Check for missing values in your df_ords dataframe

In [30]:
df_ords.isnull().sum()  # There are 206209 missing values in days_since_prior_order column

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [31]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [32]:
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

### Days_since_prior_order shows the number of days since a user/customer has made an order. It is possible we do not have this information because they are new customers.

# 11. Address the missing values using an appropriate method

### One way to approach the missing values is to create a flag. Nan will stand for a 'First Order' (as we have no information on their prior orders), and the other entries will be 'Repeat Customer'. I decided to use this method instead of deleting these observations as in this case having NaN in this column can be used in analysis.

In [33]:
 #from Careerfoundary Forumn - created a flag 

df_ords['first_order'] = np.where(np.isnan(df_ords['days_since_prior_order'].values), 'First Order', 'Repeat Customer')

In [34]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,First Order
1,1,2398795,1,2,3,7,15.0,Repeat Customer
2,2,473747,1,3,3,12,21.0,Repeat Customer
3,3,2254736,1,4,4,7,29.0,Repeat Customer
4,4,431534,1,5,4,15,28.0,Repeat Customer

# 12. Check for duplicate values in your df_ords data

In [35]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [36]:
df_ords_dups  #There are no duplicates

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

# 13. Exporting Dataframes to CSV

In [37]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data', 'Prepared Data', 'products_checked.csv'))

In [39]:
df_ords.to_csv(os.path.join(path,'02 Data', 'Prepared Data', 'orders_checked.csv'))